v2506/run/verification1/case_0000/Allpre
##!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

. $WM_PROJECT_DIR/bin/tools/RunFunctions

restore0Dir

touch case.foam

runApplication blockMesh

#runApplication setExprFields

#------------------------------------------------------------------------------