v2506/run/verification1/case_0000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../settings"

scale       1;
halfAngle   1;

x           #eval "$R * cos(degToRad($halfAngle))";
y_pos       #eval "$R * sin(degToRad($halfAngle))";
y_neg       #eval "-1 * $y_pos";

vertices
(
    (0  0 0)        //0
    ($x $y_neg 0)   //1
    ($x $y_pos 0)   //2
    (0  0 $z)       //3
    ($x $y_neg $z)  //4
    ($x $y_pos $z)  //5
);

blocks
(
    hex (0 1 2 0 3 4 5 3) ($n_R 1 $n_z) simpleGrading (1 1 1)
);

edges
(
    arc 1 2 ($R 0 0)
    arc 4 5 ($R 0 $z)
);

boundary
(
    surface
    {
        type wall;
        faces
        (
            (1 2 5 4)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 2 1 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 4 5 3)
        );
    }

    wedge_lower
    {
        type wedge;
        faces
        (  
            (0 1 4 3)
        );
    }

    wedge_upper
    {
        type wedge;
        faces
        (
            (2 0 3 5)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
